sipeed/M1s_BL808_SDK/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/dsp2_reg/dvp2axi_reg.h
/*
 * Copyright (c) 2020 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __DVP2AXI_REG_H__
#define  __DVP2AXI_REG_H__

#include "bl808.h"

/* 0x0 : dvp2axi_configue */
#define DVP2AXI_CONFIGUE_OFFSET                                 (0x0)
#define DVP2AXI_REG_DVP_ENABLE                                  DVP2AXI_REG_DVP_ENABLE
#define DVP2AXI_REG_DVP_ENABLE_POS                              (0U)
#define DVP2AXI_REG_DVP_ENABLE_LEN                              (1U)
#define DVP2AXI_REG_DVP_ENABLE_MSK                              (((1U<<DVP2AXI_REG_DVP_ENABLE_LEN)-1)<<DVP2AXI_REG_DVP_ENABLE_POS)
#define DVP2AXI_REG_DVP_ENABLE_UMSK                             (~(((1U<<DVP2AXI_REG_DVP_ENABLE_LEN)-1)<<DVP2AXI_REG_DVP_ENABLE_POS))
#define DVP2AXI_REG_SW_MODE                                     DVP2AXI_REG_SW_MODE
#define DVP2AXI_REG_SW_MODE_POS                                 (1U)
#define DVP2AXI_REG_SW_MODE_LEN                                 (1U)
#define DVP2AXI_REG_SW_MODE_MSK                                 (((1U<<DVP2AXI_REG_SW_MODE_LEN)-1)<<DVP2AXI_REG_SW_MODE_POS)
#define DVP2AXI_REG_SW_MODE_UMSK                                (~(((1U<<DVP2AXI_REG_SW_MODE_LEN)-1)<<DVP2AXI_REG_SW_MODE_POS))
#define DVP2AXI_REG_FRAM_VLD_POL                                DVP2AXI_REG_FRAM_VLD_POL
#define DVP2AXI_REG_FRAM_VLD_POL_POS                            (2U)
#define DVP2AXI_REG_FRAM_VLD_POL_LEN                            (1U)
#define DVP2AXI_REG_FRAM_VLD_POL_MSK                            (((1U<<DVP2AXI_REG_FRAM_VLD_POL_LEN)-1)<<DVP2AXI_REG_FRAM_VLD_POL_POS)
#define DVP2AXI_REG_FRAM_VLD_POL_UMSK                           (~(((1U<<DVP2AXI_REG_FRAM_VLD_POL_LEN)-1)<<DVP2AXI_REG_FRAM_VLD_POL_POS))
#define DVP2AXI_REG_LINE_VLD_POL                                DVP2AXI_REG_LINE_VLD_POL
#define DVP2AXI_REG_LINE_VLD_POL_POS                            (3U)
#define DVP2AXI_REG_LINE_VLD_POL_LEN                            (1U)
#define DVP2AXI_REG_LINE_VLD_POL_MSK                            (((1U<<DVP2AXI_REG_LINE_VLD_POL_LEN)-1)<<DVP2AXI_REG_LINE_VLD_POL_POS)
#define DVP2AXI_REG_LINE_VLD_POL_UMSK                           (~(((1U<<DVP2AXI_REG_LINE_VLD_POL_LEN)-1)<<DVP2AXI_REG_LINE_VLD_POL_POS))
#define DVP2AXI_REG_XLEN                                        DVP2AXI_REG_XLEN
#define DVP2AXI_REG_XLEN_POS                                    (4U)
#define DVP2AXI_REG_XLEN_LEN                                    (3U)
#define DVP2AXI_REG_XLEN_MSK                                    (((1U<<DVP2AXI_REG_XLEN_LEN)-1)<<DVP2AXI_REG_XLEN_POS)
#define DVP2AXI_REG_XLEN_UMSK                                   (~(((1U<<DVP2AXI_REG_XLEN_LEN)-1)<<DVP2AXI_REG_XLEN_POS))
#define DVP2AXI_REG_DVP_MODE                                    DVP2AXI_REG_DVP_MODE
#define DVP2AXI_REG_DVP_MODE_POS                                (8U)
#define DVP2AXI_REG_DVP_MODE_LEN                                (3U)
#define DVP2AXI_REG_DVP_MODE_MSK                                (((1U<<DVP2AXI_REG_DVP_MODE_LEN)-1)<<DVP2AXI_REG_DVP_MODE_POS)
#define DVP2AXI_REG_DVP_MODE_UMSK                               (~(((1U<<DVP2AXI_REG_DVP_MODE_LEN)-1)<<DVP2AXI_REG_DVP_MODE_POS))
#define DVP2AXI_REG_HW_MODE_FWRAP                               DVP2AXI_REG_HW_MODE_FWRAP
#define DVP2AXI_REG_HW_MODE_FWRAP_POS                           (11U)
#define DVP2AXI_REG_HW_MODE_FWRAP_LEN                           (1U)
#define DVP2AXI_REG_HW_MODE_FWRAP_MSK                           (((1U<<DVP2AXI_REG_HW_MODE_FWRAP_LEN)-1)<<DVP2AXI_REG_HW_MODE_FWRAP_POS)
#define DVP2AXI_REG_HW_MODE_FWRAP_UMSK                          (~(((1U<<DVP2AXI_REG_HW_MODE_FWRAP_LEN)-1)<<DVP2AXI_REG_HW_MODE_FWRAP_POS))
#define DVP2AXI_REG_DROP_EN                                     DVP2AXI_REG_DROP_EN
#define DVP2AXI_REG_DROP_EN_POS                                 (12U)
#define DVP2AXI_REG_DROP_EN_LEN                                 (1U)
#define DVP2AXI_REG_DROP_EN_MSK                                 (((1U<<DVP2AXI_REG_DROP_EN_LEN)-1)<<DVP2AXI_REG_DROP_EN_POS)
#define DVP2AXI_REG_DROP_EN_UMSK                                (~(((1U<<DVP2AXI_REG_DROP_EN_LEN)-1)<<DVP2AXI_REG_DROP_EN_POS))
#define DVP2AXI_REG_DROP_EVEN                                   DVP2AXI_REG_DROP_EVEN
#define DVP2AXI_REG_DROP_EVEN_POS                               (13U)
#define DVP2AXI_REG_DROP_EVEN_LEN                               (1U)
#define DVP2AXI_REG_DROP_EVEN_MSK                               (((1U<<DVP2AXI_REG_DROP_EVEN_LEN)-1)<<DVP2AXI_REG_DROP_EVEN_POS)
#define DVP2AXI_REG_DROP_EVEN_UMSK                              (~(((1U<<DVP2AXI_REG_DROP_EVEN_LEN)-1)<<DVP2AXI_REG_DROP_EVEN_POS))
#define DVP2AXI_REG_DVP_DATA_MODE                               DVP2AXI_REG_DVP_DATA_MODE
#define DVP2AXI_REG_DVP_DATA_MODE_POS                           (16U)
#define DVP2AXI_REG_DVP_DATA_MODE_LEN                           (3U)
#define DVP2AXI_REG_DVP_DATA_MODE_MSK                           (((1U<<DVP2AXI_REG_DVP_DATA_MODE_LEN)-1)<<DVP2AXI_REG_DVP_DATA_MODE_POS)
#define DVP2AXI_REG_DVP_DATA_MODE_UMSK                          (~(((1U<<DVP2AXI_REG_DVP_DATA_MODE_LEN)-1)<<DVP2AXI_REG_DVP_DATA_MODE_POS))
#define DVP2AXI_REG_DVP_DATA_BSEL                               DVP2AXI_REG_DVP_DATA_BSEL
#define DVP2AXI_REG_DVP_DATA_BSEL_POS                           (19U)
#define DVP2AXI_REG_DVP_DATA_BSEL_LEN                           (1U)
#define DVP2AXI_REG_DVP_DATA_BSEL_MSK                           (((1U<<DVP2AXI_REG_DVP_DATA_BSEL_LEN)-1)<<DVP2AXI_REG_DVP_DATA_BSEL_POS)
#define DVP2AXI_REG_DVP_DATA_BSEL_UMSK                          (~(((1U<<DVP2AXI_REG_DVP_DATA_BSEL_LEN)-1)<<DVP2AXI_REG_DVP_DATA_BSEL_POS))
#define DVP2AXI_REG_DVP_PIX_CLK_CG                              DVP2AXI_REG_DVP_PIX_CLK_CG
#define DVP2AXI_REG_DVP_PIX_CLK_CG_POS                          (20U)
#define DVP2AXI_REG_DVP_PIX_CLK_CG_LEN                          (1U)
#define DVP2AXI_REG_DVP_PIX_CLK_CG_MSK                          (((1U<<DVP2AXI_REG_DVP_PIX_CLK_CG_LEN)-1)<<DVP2AXI_REG_DVP_PIX_CLK_CG_POS)
#define DVP2AXI_REG_DVP_PIX_CLK_CG_UMSK                         (~(((1U<<DVP2AXI_REG_DVP_PIX_CLK_CG_LEN)-1)<<DVP2AXI_REG_DVP_PIX_CLK_CG_POS))
#define DVP2AXI_REG_V_SUBSAMPLE_EN                              DVP2AXI_REG_V_SUBSAMPLE_EN
#define DVP2AXI_REG_V_SUBSAMPLE_EN_POS                          (22U)
#define DVP2AXI_REG_V_SUBSAMPLE_EN_LEN                          (1U)
#define DVP2AXI_REG_V_SUBSAMPLE_EN_MSK                          (((1U<<DVP2AXI_REG_V_SUBSAMPLE_EN_LEN)-1)<<DVP2AXI_REG_V_SUBSAMPLE_EN_POS)
#define DVP2AXI_REG_V_SUBSAMPLE_EN_UMSK                         (~(((1U<<DVP2AXI_REG_V_SUBSAMPLE_EN_LEN)-1)<<DVP2AXI_REG_V_SUBSAMPLE_EN_POS))
#define DVP2AXI_REG_V_SUBSAMPLE_POL                             DVP2AXI_REG_V_SUBSAMPLE_POL
#define DVP2AXI_REG_V_SUBSAMPLE_POL_POS                         (23U)
#define DVP2AXI_REG_V_SUBSAMPLE_POL_LEN                         (1U)
#define DVP2AXI_REG_V_SUBSAMPLE_POL_MSK                         (((1U<<DVP2AXI_REG_V_SUBSAMPLE_POL_LEN)-1)<<DVP2AXI_REG_V_SUBSAMPLE_POL_POS)
#define DVP2AXI_REG_V_SUBSAMPLE_POL_UMSK                        (~(((1U<<DVP2AXI_REG_V_SUBSAMPLE_POL_LEN)-1)<<DVP2AXI_REG_V_SUBSAMPLE_POL_POS))
#define DVP2AXI_REG_DVP_WAIT_CYCLE                              DVP2AXI_REG_DVP_WAIT_CYCLE
#define DVP2AXI_REG_DVP_WAIT_CYCLE_POS                          (24U)
#define DVP2AXI_REG_DVP_WAIT_CYCLE_LEN                          (8U)
#define DVP2AXI_REG_DVP_WAIT_CYCLE_MSK                          (((1U<<DVP2AXI_REG_DVP_WAIT_CYCLE_LEN)-1)<<DVP2AXI_REG_DVP_WAIT_CYCLE_POS)
#define DVP2AXI_REG_DVP_WAIT_CYCLE_UMSK                         (~(((1U<<DVP2AXI_REG_DVP_WAIT_CYCLE_LEN)-1)<<DVP2AXI_REG_DVP_WAIT_CYCLE_POS))

