sipeed/M1s_BL808_SDK/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/dsp2_reg/dvp2axi_reg.h
/* 0x4 : dvp2axi_addr_start */
#define DVP2AXI_ADDR_START_OFFSET                               (0x4)
#define DVP2AXI_REG_ADDR_START                                  DVP2AXI_REG_ADDR_START
#define DVP2AXI_REG_ADDR_START_POS                              (0U)
#define DVP2AXI_REG_ADDR_START_LEN                              (32U)
#define DVP2AXI_REG_ADDR_START_MSK                              (((1U<<DVP2AXI_REG_ADDR_START_LEN)-1)<<DVP2AXI_REG_ADDR_START_POS)
#define DVP2AXI_REG_ADDR_START_UMSK                             (~(((1U<<DVP2AXI_REG_ADDR_START_LEN)-1)<<DVP2AXI_REG_ADDR_START_POS))

/* 0x8 : dvp2axi_mem_bcnt */
#define DVP2AXI_MEM_BCNT_OFFSET                                 (0x8)
#define DVP2AXI_REG_MEM_BURST_CNT                               DVP2AXI_REG_MEM_BURST_CNT
#define DVP2AXI_REG_MEM_BURST_CNT_POS                           (0U)
#define DVP2AXI_REG_MEM_BURST_CNT_LEN                           (32U)
#define DVP2AXI_REG_MEM_BURST_CNT_MSK                           (((1U<<DVP2AXI_REG_MEM_BURST_CNT_LEN)-1)<<DVP2AXI_REG_MEM_BURST_CNT_POS)
#define DVP2AXI_REG_MEM_BURST_CNT_UMSK                          (~(((1U<<DVP2AXI_REG_MEM_BURST_CNT_LEN)-1)<<DVP2AXI_REG_MEM_BURST_CNT_POS))

/* 0xC : dvp_status_and_error */
#define DVP2AXI_DVP_STATUS_AND_ERROR_OFFSET                     (0xC)
#define DVP2AXI_REG_FRAME_CNT_TRGR_INT                          DVP2AXI_REG_FRAME_CNT_TRGR_INT
#define DVP2AXI_REG_FRAME_CNT_TRGR_INT_POS                      (0U)
#define DVP2AXI_REG_FRAME_CNT_TRGR_INT_LEN                      (5U)
#define DVP2AXI_REG_FRAME_CNT_TRGR_INT_MSK                      (((1U<<DVP2AXI_REG_FRAME_CNT_TRGR_INT_LEN)-1)<<DVP2AXI_REG_FRAME_CNT_TRGR_INT_POS)
#define DVP2AXI_REG_FRAME_CNT_TRGR_INT_UMSK                     (~(((1U<<DVP2AXI_REG_FRAME_CNT_TRGR_INT_LEN)-1)<<DVP2AXI_REG_FRAME_CNT_TRGR_INT_POS))
#define DVP2AXI_REG_INT_HCNT_EN                                 DVP2AXI_REG_INT_HCNT_EN
#define DVP2AXI_REG_INT_HCNT_EN_POS                             (6U)
#define DVP2AXI_REG_INT_HCNT_EN_LEN                             (1U)
#define DVP2AXI_REG_INT_HCNT_EN_MSK                             (((1U<<DVP2AXI_REG_INT_HCNT_EN_LEN)-1)<<DVP2AXI_REG_INT_HCNT_EN_POS)
#define DVP2AXI_REG_INT_HCNT_EN_UMSK                            (~(((1U<<DVP2AXI_REG_INT_HCNT_EN_LEN)-1)<<DVP2AXI_REG_INT_HCNT_EN_POS))
#define DVP2AXI_REG_INT_VCNT_EN                                 DVP2AXI_REG_INT_VCNT_EN
#define DVP2AXI_REG_INT_VCNT_EN_POS                             (7U)
#define DVP2AXI_REG_INT_VCNT_EN_LEN                             (1U)
#define DVP2AXI_REG_INT_VCNT_EN_MSK                             (((1U<<DVP2AXI_REG_INT_VCNT_EN_LEN)-1)<<DVP2AXI_REG_INT_VCNT_EN_POS)
#define DVP2AXI_REG_INT_VCNT_EN_UMSK                            (~(((1U<<DVP2AXI_REG_INT_VCNT_EN_LEN)-1)<<DVP2AXI_REG_INT_VCNT_EN_POS))
#define DVP2AXI_REG_INT_NORMAL_EN                               DVP2AXI_REG_INT_NORMAL_EN
#define DVP2AXI_REG_INT_NORMAL_EN_POS                           (8U)
#define DVP2AXI_REG_INT_NORMAL_EN_LEN                           (1U)
#define DVP2AXI_REG_INT_NORMAL_EN_MSK                           (((1U<<DVP2AXI_REG_INT_NORMAL_EN_LEN)-1)<<DVP2AXI_REG_INT_NORMAL_EN_POS)
#define DVP2AXI_REG_INT_NORMAL_EN_UMSK                          (~(((1U<<DVP2AXI_REG_INT_NORMAL_EN_LEN)-1)<<DVP2AXI_REG_INT_NORMAL_EN_POS))
#define DVP2AXI_REG_INT_MEM_EN                                  DVP2AXI_REG_INT_MEM_EN
#define DVP2AXI_REG_INT_MEM_EN_POS                              (9U)
#define DVP2AXI_REG_INT_MEM_EN_LEN                              (1U)
#define DVP2AXI_REG_INT_MEM_EN_MSK                              (((1U<<DVP2AXI_REG_INT_MEM_EN_LEN)-1)<<DVP2AXI_REG_INT_MEM_EN_POS)
#define DVP2AXI_REG_INT_MEM_EN_UMSK                             (~(((1U<<DVP2AXI_REG_INT_MEM_EN_LEN)-1)<<DVP2AXI_REG_INT_MEM_EN_POS))
#define DVP2AXI_REG_INT_FRAME_EN                                DVP2AXI_REG_INT_FRAME_EN
#define DVP2AXI_REG_INT_FRAME_EN_POS                            (10U)
#define DVP2AXI_REG_INT_FRAME_EN_LEN                            (1U)
#define DVP2AXI_REG_INT_FRAME_EN_MSK                            (((1U<<DVP2AXI_REG_INT_FRAME_EN_LEN)-1)<<DVP2AXI_REG_INT_FRAME_EN_POS)
#define DVP2AXI_REG_INT_FRAME_EN_UMSK                           (~(((1U<<DVP2AXI_REG_INT_FRAME_EN_LEN)-1)<<DVP2AXI_REG_INT_FRAME_EN_POS))
#define DVP2AXI_REG_INT_FIFO_EN                                 DVP2AXI_REG_INT_FIFO_EN
#define DVP2AXI_REG_INT_FIFO_EN_POS                             (11U)
#define DVP2AXI_REG_INT_FIFO_EN_LEN                             (1U)
#define DVP2AXI_REG_INT_FIFO_EN_MSK                             (((1U<<DVP2AXI_REG_INT_FIFO_EN_LEN)-1)<<DVP2AXI_REG_INT_FIFO_EN_POS)
#define DVP2AXI_REG_INT_FIFO_EN_UMSK                            (~(((1U<<DVP2AXI_REG_INT_FIFO_EN_LEN)-1)<<DVP2AXI_REG_INT_FIFO_EN_POS))
#define DVP2AXI_STS_NORMAL_INT                                  DVP2AXI_STS_NORMAL_INT
#define DVP2AXI_STS_NORMAL_INT_POS                              (12U)
#define DVP2AXI_STS_NORMAL_INT_LEN                              (1U)
#define DVP2AXI_STS_NORMAL_INT_MSK                              (((1U<<DVP2AXI_STS_NORMAL_INT_LEN)-1)<<DVP2AXI_STS_NORMAL_INT_POS)
#define DVP2AXI_STS_NORMAL_INT_UMSK                             (~(((1U<<DVP2AXI_STS_NORMAL_INT_LEN)-1)<<DVP2AXI_STS_NORMAL_INT_POS))
#define DVP2AXI_STS_MEM_INT                                     DVP2AXI_STS_MEM_INT
#define DVP2AXI_STS_MEM_INT_POS                                 (13U)
#define DVP2AXI_STS_MEM_INT_LEN                                 (1U)
#define DVP2AXI_STS_MEM_INT_MSK                                 (((1U<<DVP2AXI_STS_MEM_INT_LEN)-1)<<DVP2AXI_STS_MEM_INT_POS)
#define DVP2AXI_STS_MEM_INT_UMSK                                (~(((1U<<DVP2AXI_STS_MEM_INT_LEN)-1)<<DVP2AXI_STS_MEM_INT_POS))
#define DVP2AXI_STS_FRAME_INT                                   DVP2AXI_STS_FRAME_INT
#define DVP2AXI_STS_FRAME_INT_POS                               (14U)
#define DVP2AXI_STS_FRAME_INT_LEN                               (1U)
#define DVP2AXI_STS_FRAME_INT_MSK                               (((1U<<DVP2AXI_STS_FRAME_INT_LEN)-1)<<DVP2AXI_STS_FRAME_INT_POS)
#define DVP2AXI_STS_FRAME_INT_UMSK                              (~(((1U<<DVP2AXI_STS_FRAME_INT_LEN)-1)<<DVP2AXI_STS_FRAME_INT_POS))
#define DVP2AXI_STS_FIFO_INT                                    DVP2AXI_STS_FIFO_INT
#define DVP2AXI_STS_FIFO_INT_POS                                (15U)
#define DVP2AXI_STS_FIFO_INT_LEN                                (1U)
#define DVP2AXI_STS_FIFO_INT_MSK                                (((1U<<DVP2AXI_STS_FIFO_INT_LEN)-1)<<DVP2AXI_STS_FIFO_INT_POS)
#define DVP2AXI_STS_FIFO_INT_UMSK                               (~(((1U<<DVP2AXI_STS_FIFO_INT_LEN)-1)<<DVP2AXI_STS_FIFO_INT_POS))
#define DVP2AXI_FRAME_VALID_CNT                                 DVP2AXI_FRAME_VALID_CNT
#define DVP2AXI_FRAME_VALID_CNT_POS                             (16U)
#define DVP2AXI_FRAME_VALID_CNT_LEN                             (5U)
#define DVP2AXI_FRAME_VALID_CNT_MSK                             (((1U<<DVP2AXI_FRAME_VALID_CNT_LEN)-1)<<DVP2AXI_FRAME_VALID_CNT_POS)
#define DVP2AXI_FRAME_VALID_CNT_UMSK                            (~(((1U<<DVP2AXI_FRAME_VALID_CNT_LEN)-1)<<DVP2AXI_FRAME_VALID_CNT_POS))
#define DVP2AXI_STS_HCNT_INT                                    DVP2AXI_STS_HCNT_INT
#define DVP2AXI_STS_HCNT_INT_POS                                (21U)
#define DVP2AXI_STS_HCNT_INT_LEN                                (1U)
#define DVP2AXI_STS_HCNT_INT_MSK                                (((1U<<DVP2AXI_STS_HCNT_INT_LEN)-1)<<DVP2AXI_STS_HCNT_INT_POS)
#define DVP2AXI_STS_HCNT_INT_UMSK                               (~(((1U<<DVP2AXI_STS_HCNT_INT_LEN)-1)<<DVP2AXI_STS_HCNT_INT_POS))
#define DVP2AXI_STS_VCNT_INT                                    DVP2AXI_STS_VCNT_INT
#define DVP2AXI_STS_VCNT_INT_POS                                (22U)
#define DVP2AXI_STS_VCNT_INT_LEN                                (1U)
#define DVP2AXI_STS_VCNT_INT_MSK                                (((1U<<DVP2AXI_STS_VCNT_INT_LEN)-1)<<DVP2AXI_STS_VCNT_INT_POS)
#define DVP2AXI_STS_VCNT_INT_UMSK                               (~(((1U<<DVP2AXI_STS_VCNT_INT_LEN)-1)<<DVP2AXI_STS_VCNT_INT_POS))
#define DVP2AXI_ST_BUS_IDLE                                     DVP2AXI_ST_BUS_IDLE
#define DVP2AXI_ST_BUS_IDLE_POS                                 (24U)
#define DVP2AXI_ST_BUS_IDLE_LEN                                 (1U)
#define DVP2AXI_ST_BUS_IDLE_MSK                                 (((1U<<DVP2AXI_ST_BUS_IDLE_LEN)-1)<<DVP2AXI_ST_BUS_IDLE_POS)
#define DVP2AXI_ST_BUS_IDLE_UMSK                                (~(((1U<<DVP2AXI_ST_BUS_IDLE_LEN)-1)<<DVP2AXI_ST_BUS_IDLE_POS))
#define DVP2AXI_ST_BUS_FUNC                                     DVP2AXI_ST_BUS_FUNC
#define DVP2AXI_ST_BUS_FUNC_POS                                 (25U)
#define DVP2AXI_ST_BUS_FUNC_LEN                                 (1U)
#define DVP2AXI_ST_BUS_FUNC_MSK                                 (((1U<<DVP2AXI_ST_BUS_FUNC_LEN)-1)<<DVP2AXI_ST_BUS_FUNC_POS)
#define DVP2AXI_ST_BUS_FUNC_UMSK                                (~(((1U<<DVP2AXI_ST_BUS_FUNC_LEN)-1)<<DVP2AXI_ST_BUS_FUNC_POS))
#define DVP2AXI_ST_BUS_WAIT                                     DVP2AXI_ST_BUS_WAIT
#define DVP2AXI_ST_BUS_WAIT_POS                                 (26U)
#define DVP2AXI_ST_BUS_WAIT_LEN                                 (1U)
#define DVP2AXI_ST_BUS_WAIT_MSK                                 (((1U<<DVP2AXI_ST_BUS_WAIT_LEN)-1)<<DVP2AXI_ST_BUS_WAIT_POS)
#define DVP2AXI_ST_BUS_WAIT_UMSK                                (~(((1U<<DVP2AXI_ST_BUS_WAIT_LEN)-1)<<DVP2AXI_ST_BUS_WAIT_POS))
#define DVP2AXI_ST_BUS_FLSH                                     DVP2AXI_ST_BUS_FLSH
#define DVP2AXI_ST_BUS_FLSH_POS                                 (27U)
#define DVP2AXI_ST_BUS_FLSH_LEN                                 (1U)
#define DVP2AXI_ST_BUS_FLSH_MSK                                 (((1U<<DVP2AXI_ST_BUS_FLSH_LEN)-1)<<DVP2AXI_ST_BUS_FLSH_POS)
#define DVP2AXI_ST_BUS_FLSH_UMSK                                (~(((1U<<DVP2AXI_ST_BUS_FLSH_LEN)-1)<<DVP2AXI_ST_BUS_FLSH_POS))
#define DVP2AXI_AXI_IDLE                                        DVP2AXI_AXI_IDLE
#define DVP2AXI_AXI_IDLE_POS                                    (28U)
#define DVP2AXI_AXI_IDLE_LEN                                    (1U)
#define DVP2AXI_AXI_IDLE_MSK                                    (((1U<<DVP2AXI_AXI_IDLE_LEN)-1)<<DVP2AXI_AXI_IDLE_POS)
#define DVP2AXI_AXI_IDLE_UMSK                                   (~(((1U<<DVP2AXI_AXI_IDLE_LEN)-1)<<DVP2AXI_AXI_IDLE_POS))
#define DVP2AXI_ST_DVP_IDLE                                     DVP2AXI_ST_DVP_IDLE
#define DVP2AXI_ST_DVP_IDLE_POS                                 (29U)
#define DVP2AXI_ST_DVP_IDLE_LEN                                 (1U)
#define DVP2AXI_ST_DVP_IDLE_MSK                                 (((1U<<DVP2AXI_ST_DVP_IDLE_LEN)-1)<<DVP2AXI_ST_DVP_IDLE_POS)
#define DVP2AXI_ST_DVP_IDLE_UMSK                                (~(((1U<<DVP2AXI_ST_DVP_IDLE_LEN)-1)<<DVP2AXI_ST_DVP_IDLE_POS))

/* 0x10 : dvp2axi_frame_bcnt */
#define DVP2AXI_FRAME_BCNT_OFFSET                               (0x10)
#define DVP2AXI_REG_FRAME_BYTE_CNT                              DVP2AXI_REG_FRAME_BYTE_CNT
#define DVP2AXI_REG_FRAME_BYTE_CNT_POS                          (0U)
#define DVP2AXI_REG_FRAME_BYTE_CNT_LEN                          (32U)
#define DVP2AXI_REG_FRAME_BYTE_CNT_MSK                          (((1U<<DVP2AXI_REG_FRAME_BYTE_CNT_LEN)-1)<<DVP2AXI_REG_FRAME_BYTE_CNT_POS)
#define DVP2AXI_REG_FRAME_BYTE_CNT_UMSK                         (~(((1U<<DVP2AXI_REG_FRAME_BYTE_CNT_LEN)-1)<<DVP2AXI_REG_FRAME_BYTE_CNT_POS))

/* 0x14 : dvp_frame_fifo_pop */
#define DVP2AXI_DVP_FRAME_FIFO_POP_OFFSET                       (0x14)
#define DVP2AXI_RFIFO_POP                                       DVP2AXI_RFIFO_POP
#define DVP2AXI_RFIFO_POP_POS                                   (0U)
#define DVP2AXI_RFIFO_POP_LEN                                   (1U)
#define DVP2AXI_RFIFO_POP_MSK                                   (((1U<<DVP2AXI_RFIFO_POP_LEN)-1)<<DVP2AXI_RFIFO_POP_POS)
#define DVP2AXI_RFIFO_POP_UMSK                                  (~(((1U<<DVP2AXI_RFIFO_POP_LEN)-1)<<DVP2AXI_RFIFO_POP_POS))
#define DVP2AXI_REG_INT_NORMAL_CLR                              DVP2AXI_REG_INT_NORMAL_CLR
#define DVP2AXI_REG_INT_NORMAL_CLR_POS                          (4U)
#define DVP2AXI_REG_INT_NORMAL_CLR_LEN                          (1U)
#define DVP2AXI_REG_INT_NORMAL_CLR_MSK                          (((1U<<DVP2AXI_REG_INT_NORMAL_CLR_LEN)-1)<<DVP2AXI_REG_INT_NORMAL_CLR_POS)
#define DVP2AXI_REG_INT_NORMAL_CLR_UMSK                         (~(((1U<<DVP2AXI_REG_INT_NORMAL_CLR_LEN)-1)<<DVP2AXI_REG_INT_NORMAL_CLR_POS))
#define DVP2AXI_REG_INT_MEM_CLR                                 DVP2AXI_REG_INT_MEM_CLR
#define DVP2AXI_REG_INT_MEM_CLR_POS                             (5U)
#define DVP2AXI_REG_INT_MEM_CLR_LEN                             (1U)
#define DVP2AXI_REG_INT_MEM_CLR_MSK                             (((1U<<DVP2AXI_REG_INT_MEM_CLR_LEN)-1)<<DVP2AXI_REG_INT_MEM_CLR_POS)
#define DVP2AXI_REG_INT_MEM_CLR_UMSK                            (~(((1U<<DVP2AXI_REG_INT_MEM_CLR_LEN)-1)<<DVP2AXI_REG_INT_MEM_CLR_POS))
#define DVP2AXI_REG_INT_FRAME_CLR                               DVP2AXI_REG_INT_FRAME_CLR
#define DVP2AXI_REG_INT_FRAME_CLR_POS                           (6U)
#define DVP2AXI_REG_INT_FRAME_CLR_LEN                           (1U)
#define DVP2AXI_REG_INT_FRAME_CLR_MSK                           (((1U<<DVP2AXI_REG_INT_FRAME_CLR_LEN)-1)<<DVP2AXI_REG_INT_FRAME_CLR_POS)
#define DVP2AXI_REG_INT_FRAME_CLR_UMSK                          (~(((1U<<DVP2AXI_REG_INT_FRAME_CLR_LEN)-1)<<DVP2AXI_REG_INT_FRAME_CLR_POS))
#define DVP2AXI_REG_INT_FIFO_CLR                                DVP2AXI_REG_INT_FIFO_CLR
#define DVP2AXI_REG_INT_FIFO_CLR_POS                            (7U)
#define DVP2AXI_REG_INT_FIFO_CLR_LEN                            (1U)
#define DVP2AXI_REG_INT_FIFO_CLR_MSK                            (((1U<<DVP2AXI_REG_INT_FIFO_CLR_LEN)-1)<<DVP2AXI_REG_INT_FIFO_CLR_POS)
#define DVP2AXI_REG_INT_FIFO_CLR_UMSK                           (~(((1U<<DVP2AXI_REG_INT_FIFO_CLR_LEN)-1)<<DVP2AXI_REG_INT_FIFO_CLR_POS))
#define DVP2AXI_REG_INT_HCNT_CLR                                DVP2AXI_REG_INT_HCNT_CLR
#define DVP2AXI_REG_INT_HCNT_CLR_POS                            (8U)
#define DVP2AXI_REG_INT_HCNT_CLR_LEN                            (1U)
#define DVP2AXI_REG_INT_HCNT_CLR_MSK                            (((1U<<DVP2AXI_REG_INT_HCNT_CLR_LEN)-1)<<DVP2AXI_REG_INT_HCNT_CLR_POS)
#define DVP2AXI_REG_INT_HCNT_CLR_UMSK                           (~(((1U<<DVP2AXI_REG_INT_HCNT_CLR_LEN)-1)<<DVP2AXI_REG_INT_HCNT_CLR_POS))
#define DVP2AXI_REG_INT_VCNT_CLR                                DVP2AXI_REG_INT_VCNT_CLR
#define DVP2AXI_REG_INT_VCNT_CLR_POS                            (9U)
#define DVP2AXI_REG_INT_VCNT_CLR_LEN                            (1U)
#define DVP2AXI_REG_INT_VCNT_CLR_MSK                            (((1U<<DVP2AXI_REG_INT_VCNT_CLR_LEN)-1)<<DVP2AXI_REG_INT_VCNT_CLR_POS)
#define DVP2AXI_REG_INT_VCNT_CLR_UMSK                           (~(((1U<<DVP2AXI_REG_INT_VCNT_CLR_LEN)-1)<<DVP2AXI_REG_INT_VCNT_CLR_POS))

/* 0x18 : dvp2axi_frame_vld */
#define DVP2AXI_FRAME_VLD_OFFSET                                (0x18)
#define DVP2AXI_REG_FRAME_N_VLD                                 DVP2AXI_REG_FRAME_N_VLD
#define DVP2AXI_REG_FRAME_N_VLD_POS                             (0U)
#define DVP2AXI_REG_FRAME_N_VLD_LEN                             (32U)
#define DVP2AXI_REG_FRAME_N_VLD_MSK                             (((1U<<DVP2AXI_REG_FRAME_N_VLD_LEN)-1)<<DVP2AXI_REG_FRAME_N_VLD_POS)
#define DVP2AXI_REG_FRAME_N_VLD_UMSK                            (~(((1U<<DVP2AXI_REG_FRAME_N_VLD_LEN)-1)<<DVP2AXI_REG_FRAME_N_VLD_POS))

/* 0x1C : dvp2axi_frame_period */
#define DVP2AXI_FRAME_PERIOD_OFFSET                             (0x1C)
#define DVP2AXI_REG_FRAME_PERIOD                                DVP2AXI_REG_FRAME_PERIOD
#define DVP2AXI_REG_FRAME_PERIOD_POS                            (0U)
#define DVP2AXI_REG_FRAME_PERIOD_LEN                            (5U)
#define DVP2AXI_REG_FRAME_PERIOD_MSK                            (((1U<<DVP2AXI_REG_FRAME_PERIOD_LEN)-1)<<DVP2AXI_REG_FRAME_PERIOD_POS)
#define DVP2AXI_REG_FRAME_PERIOD_UMSK                           (~(((1U<<DVP2AXI_REG_FRAME_PERIOD_LEN)-1)<<DVP2AXI_REG_FRAME_PERIOD_POS))

