sipeed/M1s_BL808_SDK/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/dsp2_reg/dvp2axi_reg.h
/* 0x20 : dvp2axi_misc */
#define DVP2AXI_MISC_OFFSET                                     (0x20)
#define DVP2AXI_REG_ALPHA                                       DVP2AXI_REG_ALPHA
#define DVP2AXI_REG_ALPHA_POS                                   (0U)
#define DVP2AXI_REG_ALPHA_LEN                                   (8U)
#define DVP2AXI_REG_ALPHA_MSK                                   (((1U<<DVP2AXI_REG_ALPHA_LEN)-1)<<DVP2AXI_REG_ALPHA_POS)
#define DVP2AXI_REG_ALPHA_UMSK                                  (~(((1U<<DVP2AXI_REG_ALPHA_LEN)-1)<<DVP2AXI_REG_ALPHA_POS))
#define DVP2AXI_REG_FORMAT_565                                  DVP2AXI_REG_FORMAT_565
#define DVP2AXI_REG_FORMAT_565_POS                              (8U)
#define DVP2AXI_REG_FORMAT_565_LEN                              (3U)
#define DVP2AXI_REG_FORMAT_565_MSK                              (((1U<<DVP2AXI_REG_FORMAT_565_LEN)-1)<<DVP2AXI_REG_FORMAT_565_POS)
#define DVP2AXI_REG_FORMAT_565_UMSK                             (~(((1U<<DVP2AXI_REG_FORMAT_565_LEN)-1)<<DVP2AXI_REG_FORMAT_565_POS))

/* 0x30 : dvp2axi_hsync_crop */
#define DVP2AXI_HSYNC_CROP_OFFSET                               (0x30)
#define DVP2AXI_REG_HSYNC_ACT_END                               DVP2AXI_REG_HSYNC_ACT_END
#define DVP2AXI_REG_HSYNC_ACT_END_POS                           (0U)
#define DVP2AXI_REG_HSYNC_ACT_END_LEN                           (16U)
#define DVP2AXI_REG_HSYNC_ACT_END_MSK                           (((1U<<DVP2AXI_REG_HSYNC_ACT_END_LEN)-1)<<DVP2AXI_REG_HSYNC_ACT_END_POS)
#define DVP2AXI_REG_HSYNC_ACT_END_UMSK                          (~(((1U<<DVP2AXI_REG_HSYNC_ACT_END_LEN)-1)<<DVP2AXI_REG_HSYNC_ACT_END_POS))
#define DVP2AXI_REG_HSYNC_ACT_START                             DVP2AXI_REG_HSYNC_ACT_START
#define DVP2AXI_REG_HSYNC_ACT_START_POS                         (16U)
#define DVP2AXI_REG_HSYNC_ACT_START_LEN                         (16U)
#define DVP2AXI_REG_HSYNC_ACT_START_MSK                         (((1U<<DVP2AXI_REG_HSYNC_ACT_START_LEN)-1)<<DVP2AXI_REG_HSYNC_ACT_START_POS)
#define DVP2AXI_REG_HSYNC_ACT_START_UMSK                        (~(((1U<<DVP2AXI_REG_HSYNC_ACT_START_LEN)-1)<<DVP2AXI_REG_HSYNC_ACT_START_POS))

/* 0x34 : dvp2axi_vsync_crop */
#define DVP2AXI_VSYNC_CROP_OFFSET                               (0x34)
#define DVP2AXI_REG_VSYNC_ACT_END                               DVP2AXI_REG_VSYNC_ACT_END
#define DVP2AXI_REG_VSYNC_ACT_END_POS                           (0U)
#define DVP2AXI_REG_VSYNC_ACT_END_LEN                           (16U)
#define DVP2AXI_REG_VSYNC_ACT_END_MSK                           (((1U<<DVP2AXI_REG_VSYNC_ACT_END_LEN)-1)<<DVP2AXI_REG_VSYNC_ACT_END_POS)
#define DVP2AXI_REG_VSYNC_ACT_END_UMSK                          (~(((1U<<DVP2AXI_REG_VSYNC_ACT_END_LEN)-1)<<DVP2AXI_REG_VSYNC_ACT_END_POS))
#define DVP2AXI_REG_VSYNC_ACT_START                             DVP2AXI_REG_VSYNC_ACT_START
#define DVP2AXI_REG_VSYNC_ACT_START_POS                         (16U)
#define DVP2AXI_REG_VSYNC_ACT_START_LEN                         (16U)
#define DVP2AXI_REG_VSYNC_ACT_START_MSK                         (((1U<<DVP2AXI_REG_VSYNC_ACT_START_LEN)-1)<<DVP2AXI_REG_VSYNC_ACT_START_POS)
#define DVP2AXI_REG_VSYNC_ACT_START_UMSK                        (~(((1U<<DVP2AXI_REG_VSYNC_ACT_START_LEN)-1)<<DVP2AXI_REG_VSYNC_ACT_START_POS))

/* 0x38 : dvp2axi_fram_exm */
#define DVP2AXI_FRAM_EXM_OFFSET                                 (0x38)
#define DVP2AXI_REG_TOTAL_HCNT                                  DVP2AXI_REG_TOTAL_HCNT
#define DVP2AXI_REG_TOTAL_HCNT_POS                              (0U)
#define DVP2AXI_REG_TOTAL_HCNT_LEN                              (16U)
#define DVP2AXI_REG_TOTAL_HCNT_MSK                              (((1U<<DVP2AXI_REG_TOTAL_HCNT_LEN)-1)<<DVP2AXI_REG_TOTAL_HCNT_POS)
#define DVP2AXI_REG_TOTAL_HCNT_UMSK                             (~(((1U<<DVP2AXI_REG_TOTAL_HCNT_LEN)-1)<<DVP2AXI_REG_TOTAL_HCNT_POS))
#define DVP2AXI_REG_TOTAL_VCNT                                  DVP2AXI_REG_TOTAL_VCNT
#define DVP2AXI_REG_TOTAL_VCNT_POS                              (16U)
#define DVP2AXI_REG_TOTAL_VCNT_LEN                              (16U)
#define DVP2AXI_REG_TOTAL_VCNT_MSK                              (((1U<<DVP2AXI_REG_TOTAL_VCNT_LEN)-1)<<DVP2AXI_REG_TOTAL_VCNT_POS)
#define DVP2AXI_REG_TOTAL_VCNT_UMSK                             (~(((1U<<DVP2AXI_REG_TOTAL_VCNT_LEN)-1)<<DVP2AXI_REG_TOTAL_VCNT_POS))

/* 0x40 : frame_start_addr0 */
#define DVP2AXI_FRAME_START_ADDR0_OFFSET                        (0x40)
#define DVP2AXI_FRAME_START_ADDR_0                              DVP2AXI_FRAME_START_ADDR_0
#define DVP2AXI_FRAME_START_ADDR_0_POS                          (0U)
#define DVP2AXI_FRAME_START_ADDR_0_LEN                          (32U)
#define DVP2AXI_FRAME_START_ADDR_0_MSK                          (((1U<<DVP2AXI_FRAME_START_ADDR_0_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_0_POS)
#define DVP2AXI_FRAME_START_ADDR_0_UMSK                         (~(((1U<<DVP2AXI_FRAME_START_ADDR_0_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_0_POS))

/* 0x48 : frame_start_addr1 */
#define DVP2AXI_FRAME_START_ADDR1_OFFSET                        (0x48)
#define DVP2AXI_FRAME_START_ADDR_1                              DVP2AXI_FRAME_START_ADDR_1
#define DVP2AXI_FRAME_START_ADDR_1_POS                          (0U)
#define DVP2AXI_FRAME_START_ADDR_1_LEN                          (32U)
#define DVP2AXI_FRAME_START_ADDR_1_MSK                          (((1U<<DVP2AXI_FRAME_START_ADDR_1_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_1_POS)
#define DVP2AXI_FRAME_START_ADDR_1_UMSK                         (~(((1U<<DVP2AXI_FRAME_START_ADDR_1_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_1_POS))

/* 0x50 : frame_start_addr2 */
#define DVP2AXI_FRAME_START_ADDR2_OFFSET                        (0x50)
#define DVP2AXI_FRAME_START_ADDR_2                              DVP2AXI_FRAME_START_ADDR_2
#define DVP2AXI_FRAME_START_ADDR_2_POS                          (0U)
#define DVP2AXI_FRAME_START_ADDR_2_LEN                          (32U)
#define DVP2AXI_FRAME_START_ADDR_2_MSK                          (((1U<<DVP2AXI_FRAME_START_ADDR_2_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_2_POS)
#define DVP2AXI_FRAME_START_ADDR_2_UMSK                         (~(((1U<<DVP2AXI_FRAME_START_ADDR_2_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_2_POS))

/* 0x58 : frame_start_addr3 */
#define DVP2AXI_FRAME_START_ADDR3_OFFSET                        (0x58)
#define DVP2AXI_FRAME_START_ADDR_3                              DVP2AXI_FRAME_START_ADDR_3
#define DVP2AXI_FRAME_START_ADDR_3_POS                          (0U)
#define DVP2AXI_FRAME_START_ADDR_3_LEN                          (32U)
#define DVP2AXI_FRAME_START_ADDR_3_MSK                          (((1U<<DVP2AXI_FRAME_START_ADDR_3_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_3_POS)
#define DVP2AXI_FRAME_START_ADDR_3_UMSK                         (~(((1U<<DVP2AXI_FRAME_START_ADDR_3_LEN)-1)<<DVP2AXI_FRAME_START_ADDR_3_POS))

