sipeed/M1s_BL808_SDK/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/dsp2_reg/dvp2axi_reg.h
/* 0xF0 : dvp_debug */
#define DVP2AXI_DVP_DEBUG_OFFSET                                (0xF0)
#define DVP2AXI_REG_DVP_DBG_EN                                  DVP2AXI_REG_DVP_DBG_EN
#define DVP2AXI_REG_DVP_DBG_EN_POS                              (0U)
#define DVP2AXI_REG_DVP_DBG_EN_LEN                              (1U)
#define DVP2AXI_REG_DVP_DBG_EN_MSK                              (((1U<<DVP2AXI_REG_DVP_DBG_EN_LEN)-1)<<DVP2AXI_REG_DVP_DBG_EN_POS)
#define DVP2AXI_REG_DVP_DBG_EN_UMSK                             (~(((1U<<DVP2AXI_REG_DVP_DBG_EN_LEN)-1)<<DVP2AXI_REG_DVP_DBG_EN_POS))
#define DVP2AXI_REG_DVP_DBG_SEL                                 DVP2AXI_REG_DVP_DBG_SEL
#define DVP2AXI_REG_DVP_DBG_SEL_POS                             (1U)
#define DVP2AXI_REG_DVP_DBG_SEL_LEN                             (3U)
#define DVP2AXI_REG_DVP_DBG_SEL_MSK                             (((1U<<DVP2AXI_REG_DVP_DBG_SEL_LEN)-1)<<DVP2AXI_REG_DVP_DBG_SEL_POS)
#define DVP2AXI_REG_DVP_DBG_SEL_UMSK                            (~(((1U<<DVP2AXI_REG_DVP_DBG_SEL_LEN)-1)<<DVP2AXI_REG_DVP_DBG_SEL_POS))

/* 0xFC : dvp_dummy_reg */
#define DVP2AXI_DVP_DUMMY_REG_OFFSET                            (0xFC)


struct  dvp2axi_reg {
    /* 0x0 : dvp2axi_configue */
    union {
        struct {
            uint32_t reg_dvp_enable                 :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_sw_mode                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_fram_vld_pol               :  1; /* [    2],        r/w,        0x1 */
            uint32_t reg_line_vld_pol               :  1; /* [    3],        r/w,        0x1 */
            uint32_t reg_xlen                       :  3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_dvp_mode                   :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t reg_hw_mode_fwrap              :  1; /* [   11],        r/w,        0x1 */
            uint32_t reg_drop_en                    :  1; /* [   12],        r/w,        0x0 */
            uint32_t reg_drop_even                  :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_dvp_data_mode              :  3; /* [18:16],        r/w,        0x0 */
            uint32_t reg_dvp_data_bsel              :  1; /* [   19],        r/w,        0x0 */
            uint32_t reg_dvp_pix_clk_cg             :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21                    :  1; /* [   21],       rsvd,        0x0 */
            uint32_t reg_v_subsample_en             :  1; /* [   22],        r/w,        0x0 */
            uint32_t reg_v_subsample_pol            :  1; /* [   23],        r/w,        0x0 */
            uint32_t reg_dvp_wait_cycle             :  8; /* [31:24],        r/w,       0x40 */
        }BF;
        uint32_t WORD;
    } dvp2axi_configue;

    /* 0x4 : dvp2axi_addr_start */
    union {
        struct {
            uint32_t reg_addr_start                 : 32; /* [31: 0],        r/w, 0x80000000 */
        }BF;
        uint32_t WORD;
    } dvp2axi_addr_start;

    /* 0x8 : dvp2axi_mem_bcnt */
    union {
        struct {
            uint32_t reg_mem_burst_cnt              : 32; /* [31: 0],        r/w,     0xc000 */
        }BF;
        uint32_t WORD;
    } dvp2axi_mem_bcnt;

    /* 0xC : dvp_status_and_error */
    union {
        struct {
            uint32_t reg_frame_cnt_trgr_int         :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5                     :  1; /* [    5],       rsvd,        0x0 */
            uint32_t reg_int_hcnt_en                :  1; /* [    6],        r/w,        0x0 */
            uint32_t reg_int_vcnt_en                :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_int_normal_en              :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_int_mem_en                 :  1; /* [    9],        r/w,        0x0 */
            uint32_t reg_int_frame_en               :  1; /* [   10],        r/w,        0x0 */
            uint32_t reg_int_fifo_en                :  1; /* [   11],        r/w,        0x1 */
            uint32_t sts_normal_int                 :  1; /* [   12],          r,        0x0 */
            uint32_t sts_mem_int                    :  1; /* [   13],          r,        0x0 */
            uint32_t sts_frame_int                  :  1; /* [   14],          r,        0x0 */
            uint32_t sts_fifo_int                   :  1; /* [   15],          r,        0x0 */
            uint32_t frame_valid_cnt                :  5; /* [20:16],          r,        0x0 */
            uint32_t sts_hcnt_int                   :  1; /* [   21],          r,        0x0 */
            uint32_t sts_vcnt_int                   :  1; /* [   22],          r,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t st_bus_idle                    :  1; /* [   24],          r,        0x1 */
            uint32_t st_bus_func                    :  1; /* [   25],          r,        0x0 */
            uint32_t st_bus_wait                    :  1; /* [   26],          r,        0x0 */
            uint32_t st_bus_flsh                    :  1; /* [   27],          r,        0x0 */
            uint32_t axi_idle                       :  1; /* [   28],          r,        0x1 */
            uint32_t st_dvp_idle                    :  1; /* [   29],          r,        0x1 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp_status_and_error;

    /* 0x10 : dvp2axi_frame_bcnt */
    union {
        struct {
            uint32_t reg_frame_byte_cnt             : 32; /* [31: 0],        r/w,     0x7e90 */
        }BF;
        uint32_t WORD;
    } dvp2axi_frame_bcnt;

    /* 0x14 : dvp_frame_fifo_pop */
    union {
        struct {
            uint32_t rfifo_pop                      :  1; /* [    0],        w1p,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_int_normal_clr             :  1; /* [    4],        w1p,        0x0 */
            uint32_t reg_int_mem_clr                :  1; /* [    5],        w1p,        0x0 */
            uint32_t reg_int_frame_clr              :  1; /* [    6],        w1p,        0x0 */
            uint32_t reg_int_fifo_clr               :  1; /* [    7],        w1p,        0x0 */
            uint32_t reg_int_hcnt_clr               :  1; /* [    8],        w1p,        0x0 */
            uint32_t reg_int_vcnt_clr               :  1; /* [    9],        w1p,        0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp_frame_fifo_pop;

    /* 0x18 : dvp2axi_frame_vld */
    union {
        struct {
            uint32_t reg_frame_n_vld                : 32; /* [31: 0],        r/w, 0xffffffff */
        }BF;
        uint32_t WORD;
    } dvp2axi_frame_vld;

    /* 0x1C : dvp2axi_frame_period */
    union {
        struct {
            uint32_t reg_frame_period               :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_31                  : 27; /* [31: 5],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp2axi_frame_period;

